Microchip-MPLAB-Harmony/dev_packs/Microchip/SAMV71_DFP/2.4.171/samv71b/include/component/rtc.h
#define RTC_TIMR_OFFSET                     (0x08)                                        /**<  (RTC_TIMR) Time Register  Offset */

#define RTC_TIMR_SEC_Pos                    0                                              /**< (RTC_TIMR) Current Second Position */
#define RTC_TIMR_SEC_Msk                    (_U_(0x7F) << RTC_TIMR_SEC_Pos)                /**< (RTC_TIMR) Current Second Mask */
#define RTC_TIMR_SEC(value)                 (RTC_TIMR_SEC_Msk & ((value) << RTC_TIMR_SEC_Pos))
#define RTC_TIMR_MIN_Pos                    8                                              /**< (RTC_TIMR) Current Minute Position */
#define RTC_TIMR_MIN_Msk                    (_U_(0x7F) << RTC_TIMR_MIN_Pos)                /**< (RTC_TIMR) Current Minute Mask */
#define RTC_TIMR_MIN(value)                 (RTC_TIMR_MIN_Msk & ((value) << RTC_TIMR_MIN_Pos))
#define RTC_TIMR_HOUR_Pos                   16                                             /**< (RTC_TIMR) Current Hour Position */
#define RTC_TIMR_HOUR_Msk                   (_U_(0x3F) << RTC_TIMR_HOUR_Pos)               /**< (RTC_TIMR) Current Hour Mask */
#define RTC_TIMR_HOUR(value)                (RTC_TIMR_HOUR_Msk & ((value) << RTC_TIMR_HOUR_Pos))
#define RTC_TIMR_AMPM_Pos                   22                                             /**< (RTC_TIMR) Ante Meridiem Post Meridiem Indicator Position */
#define RTC_TIMR_AMPM_Msk                   (_U_(0x1) << RTC_TIMR_AMPM_Pos)                /**< (RTC_TIMR) Ante Meridiem Post Meridiem Indicator Mask */
#define RTC_TIMR_AMPM                       RTC_TIMR_AMPM_Msk                              /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_TIMR_AMPM_Msk instead */
#define RTC_TIMR_MASK                       _U_(0x7F7F7F)                                  /**< \deprecated (RTC_TIMR) Register MASK  (Use RTC_TIMR_Msk instead)  */
#define RTC_TIMR_Msk                        _U_(0x7F7F7F)                                  /**< (RTC_TIMR) Register Mask  */


/* -------- RTC_CALR : (RTC Offset: 0x0c) (R/W 32) Calendar Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t CENT:7;                    /**< bit:   0..6  Current Century                          */
    uint32_t :1;                        /**< bit:      7  Reserved */
    uint32_t YEAR:8;                    /**< bit:  8..15  Current Year                             */
    uint32_t MONTH:5;                   /**< bit: 16..20  Current Month                            */
    uint32_t DAY:3;                     /**< bit: 21..23  Current Day in Current Week              */
    uint32_t DATE:6;                    /**< bit: 24..29  Current Day in Current Month             */
    uint32_t :2;                        /**< bit: 30..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_CALR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_CALR_OFFSET                     (0x0C)                                        /**<  (RTC_CALR) Calendar Register  Offset */

#define RTC_CALR_CENT_Pos                   0                                              /**< (RTC_CALR) Current Century Position */
#define RTC_CALR_CENT_Msk                   (_U_(0x7F) << RTC_CALR_CENT_Pos)               /**< (RTC_CALR) Current Century Mask */
#define RTC_CALR_CENT(value)                (RTC_CALR_CENT_Msk & ((value) << RTC_CALR_CENT_Pos))
#define RTC_CALR_YEAR_Pos                   8                                              /**< (RTC_CALR) Current Year Position */
#define RTC_CALR_YEAR_Msk                   (_U_(0xFF) << RTC_CALR_YEAR_Pos)               /**< (RTC_CALR) Current Year Mask */
#define RTC_CALR_YEAR(value)                (RTC_CALR_YEAR_Msk & ((value) << RTC_CALR_YEAR_Pos))
#define RTC_CALR_MONTH_Pos                  16                                             /**< (RTC_CALR) Current Month Position */
#define RTC_CALR_MONTH_Msk                  (_U_(0x1F) << RTC_CALR_MONTH_Pos)              /**< (RTC_CALR) Current Month Mask */
#define RTC_CALR_MONTH(value)               (RTC_CALR_MONTH_Msk & ((value) << RTC_CALR_MONTH_Pos))
#define RTC_CALR_DAY_Pos                    21                                             /**< (RTC_CALR) Current Day in Current Week Position */
#define RTC_CALR_DAY_Msk                    (_U_(0x7) << RTC_CALR_DAY_Pos)                 /**< (RTC_CALR) Current Day in Current Week Mask */
#define RTC_CALR_DAY(value)                 (RTC_CALR_DAY_Msk & ((value) << RTC_CALR_DAY_Pos))
#define RTC_CALR_DATE_Pos                   24                                             /**< (RTC_CALR) Current Day in Current Month Position */
#define RTC_CALR_DATE_Msk                   (_U_(0x3F) << RTC_CALR_DATE_Pos)               /**< (RTC_CALR) Current Day in Current Month Mask */
#define RTC_CALR_DATE(value)                (RTC_CALR_DATE_Msk & ((value) << RTC_CALR_DATE_Pos))
#define RTC_CALR_MASK                       _U_(0x3FFFFF7F)                                /**< \deprecated (RTC_CALR) Register MASK  (Use RTC_CALR_Msk instead)  */
#define RTC_CALR_Msk                        _U_(0x3FFFFF7F)                                /**< (RTC_CALR) Register Mask  */


/* -------- RTC_TIMALR : (RTC Offset: 0x10) (R/W 32) Time Alarm Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t SEC:7;                     /**< bit:   0..6  Second Alarm                             */
    uint32_t SECEN:1;                   /**< bit:      7  Second Alarm Enable                      */
    uint32_t MIN:7;                     /**< bit:  8..14  Minute Alarm                             */
    uint32_t MINEN:1;                   /**< bit:     15  Minute Alarm Enable                      */
    uint32_t HOUR:6;                    /**< bit: 16..21  Hour Alarm                               */
    uint32_t AMPM:1;                    /**< bit:     22  AM/PM Indicator                          */
    uint32_t HOUREN:1;                  /**< bit:     23  Hour Alarm Enable                        */
    uint32_t :8;                        /**< bit: 24..31  Reserved */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_TIMALR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_TIMALR_OFFSET                   (0x10)                                        /**<  (RTC_TIMALR) Time Alarm Register  Offset */

#define RTC_TIMALR_SEC_Pos                  0                                              /**< (RTC_TIMALR) Second Alarm Position */
#define RTC_TIMALR_SEC_Msk                  (_U_(0x7F) << RTC_TIMALR_SEC_Pos)              /**< (RTC_TIMALR) Second Alarm Mask */
#define RTC_TIMALR_SEC(value)               (RTC_TIMALR_SEC_Msk & ((value) << RTC_TIMALR_SEC_Pos))
#define RTC_TIMALR_SECEN_Pos                7                                              /**< (RTC_TIMALR) Second Alarm Enable Position */
#define RTC_TIMALR_SECEN_Msk                (_U_(0x1) << RTC_TIMALR_SECEN_Pos)             /**< (RTC_TIMALR) Second Alarm Enable Mask */
#define RTC_TIMALR_SECEN                    RTC_TIMALR_SECEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_TIMALR_SECEN_Msk instead */
#define RTC_TIMALR_MIN_Pos                  8                                              /**< (RTC_TIMALR) Minute Alarm Position */
#define RTC_TIMALR_MIN_Msk                  (_U_(0x7F) << RTC_TIMALR_MIN_Pos)              /**< (RTC_TIMALR) Minute Alarm Mask */
#define RTC_TIMALR_MIN(value)               (RTC_TIMALR_MIN_Msk & ((value) << RTC_TIMALR_MIN_Pos))
#define RTC_TIMALR_MINEN_Pos                15                                             /**< (RTC_TIMALR) Minute Alarm Enable Position */
#define RTC_TIMALR_MINEN_Msk                (_U_(0x1) << RTC_TIMALR_MINEN_Pos)             /**< (RTC_TIMALR) Minute Alarm Enable Mask */
#define RTC_TIMALR_MINEN                    RTC_TIMALR_MINEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_TIMALR_MINEN_Msk instead */
#define RTC_TIMALR_HOUR_Pos                 16                                             /**< (RTC_TIMALR) Hour Alarm Position */
#define RTC_TIMALR_HOUR_Msk                 (_U_(0x3F) << RTC_TIMALR_HOUR_Pos)             /**< (RTC_TIMALR) Hour Alarm Mask */
#define RTC_TIMALR_HOUR(value)              (RTC_TIMALR_HOUR_Msk & ((value) << RTC_TIMALR_HOUR_Pos))
#define RTC_TIMALR_AMPM_Pos                 22                                             /**< (RTC_TIMALR) AM/PM Indicator Position */
#define RTC_TIMALR_AMPM_Msk                 (_U_(0x1) << RTC_TIMALR_AMPM_Pos)              /**< (RTC_TIMALR) AM/PM Indicator Mask */
#define RTC_TIMALR_AMPM                     RTC_TIMALR_AMPM_Msk                            /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_TIMALR_AMPM_Msk instead */
#define RTC_TIMALR_HOUREN_Pos               23                                             /**< (RTC_TIMALR) Hour Alarm Enable Position */
#define RTC_TIMALR_HOUREN_Msk               (_U_(0x1) << RTC_TIMALR_HOUREN_Pos)            /**< (RTC_TIMALR) Hour Alarm Enable Mask */
#define RTC_TIMALR_HOUREN                   RTC_TIMALR_HOUREN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_TIMALR_HOUREN_Msk instead */
#define RTC_TIMALR_MASK                     _U_(0xFFFFFF)                                  /**< \deprecated (RTC_TIMALR) Register MASK  (Use RTC_TIMALR_Msk instead)  */
#define RTC_TIMALR_Msk                      _U_(0xFFFFFF)                                  /**< (RTC_TIMALR) Register Mask  */


/* -------- RTC_CALALR : (RTC Offset: 0x14) (R/W 32) Calendar Alarm Register -------- */
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
#if COMPONENT_TYPEDEF_STYLE == 'N'
typedef union { 
  struct {
    uint32_t :16;                       /**< bit:  0..15  Reserved */
    uint32_t MONTH:5;                   /**< bit: 16..20  Month Alarm                              */
    uint32_t :2;                        /**< bit: 21..22  Reserved */
    uint32_t MTHEN:1;                   /**< bit:     23  Month Alarm Enable                       */
    uint32_t DATE:6;                    /**< bit: 24..29  Date Alarm                               */
    uint32_t :1;                        /**< bit:     30  Reserved */
    uint32_t DATEEN:1;                  /**< bit:     31  Date Alarm Enable                        */
  } bit;                                /**< Structure used for bit  access */
  uint32_t reg;                         /**< Type used for register access */
} RTC_CALALR_Type;
#endif
#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */

#define RTC_CALALR_OFFSET                   (0x14)                                        /**<  (RTC_CALALR) Calendar Alarm Register  Offset */

#define RTC_CALALR_MONTH_Pos                16                                             /**< (RTC_CALALR) Month Alarm Position */
#define RTC_CALALR_MONTH_Msk                (_U_(0x1F) << RTC_CALALR_MONTH_Pos)            /**< (RTC_CALALR) Month Alarm Mask */
#define RTC_CALALR_MONTH(value)             (RTC_CALALR_MONTH_Msk & ((value) << RTC_CALALR_MONTH_Pos))
#define RTC_CALALR_MTHEN_Pos                23                                             /**< (RTC_CALALR) Month Alarm Enable Position */
#define RTC_CALALR_MTHEN_Msk                (_U_(0x1) << RTC_CALALR_MTHEN_Pos)             /**< (RTC_CALALR) Month Alarm Enable Mask */
#define RTC_CALALR_MTHEN                    RTC_CALALR_MTHEN_Msk                           /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_CALALR_MTHEN_Msk instead */
#define RTC_CALALR_DATE_Pos                 24                                             /**< (RTC_CALALR) Date Alarm Position */
#define RTC_CALALR_DATE_Msk                 (_U_(0x3F) << RTC_CALALR_DATE_Pos)             /**< (RTC_CALALR) Date Alarm Mask */
#define RTC_CALALR_DATE(value)              (RTC_CALALR_DATE_Msk & ((value) << RTC_CALALR_DATE_Pos))
#define RTC_CALALR_DATEEN_Pos               31                                             /**< (RTC_CALALR) Date Alarm Enable Position */
#define RTC_CALALR_DATEEN_Msk               (_U_(0x1) << RTC_CALALR_DATEEN_Pos)            /**< (RTC_CALALR) Date Alarm Enable Mask */
#define RTC_CALALR_DATEEN                   RTC_CALALR_DATEEN_Msk                          /**< \deprecated Old style mask definition for 1 bit bitfield. Use RTC_CALALR_DATEEN_Msk instead */
#define RTC_CALALR_MASK                     _U_(0xBF9F0000)                                /**< \deprecated (RTC_CALALR) Register MASK  (Use RTC_CALALR_Msk instead)  */
#define RTC_CALALR_Msk                      _U_(0xBF9F0000)                                /**< (RTC_CALALR) Register Mask  */


